zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_AXBS_LITE.h
#define AXBS_LITE_CRS7_HPE1_MASK                 (0x20000U)
#define AXBS_LITE_CRS7_HPE1_SHIFT                (17U)
#define AXBS_LITE_CRS7_HPE1_WIDTH                (1U)
#define AXBS_LITE_CRS7_HPE1(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS7_HPE1_SHIFT)) & AXBS_LITE_CRS7_HPE1_MASK)

#define AXBS_LITE_CRS7_HPE2_MASK                 (0x40000U)
#define AXBS_LITE_CRS7_HPE2_SHIFT                (18U)
#define AXBS_LITE_CRS7_HPE2_WIDTH                (1U)
#define AXBS_LITE_CRS7_HPE2(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS7_HPE2_SHIFT)) & AXBS_LITE_CRS7_HPE2_MASK)

#define AXBS_LITE_CRS7_HPE3_MASK                 (0x80000U)
#define AXBS_LITE_CRS7_HPE3_SHIFT                (19U)
#define AXBS_LITE_CRS7_HPE3_WIDTH                (1U)
#define AXBS_LITE_CRS7_HPE3(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS7_HPE3_SHIFT)) & AXBS_LITE_CRS7_HPE3_MASK)

#define AXBS_LITE_CRS7_HPE4_MASK                 (0x100000U)
#define AXBS_LITE_CRS7_HPE4_SHIFT                (20U)
#define AXBS_LITE_CRS7_HPE4_WIDTH                (1U)
#define AXBS_LITE_CRS7_HPE4(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS7_HPE4_SHIFT)) & AXBS_LITE_CRS7_HPE4_MASK)

#define AXBS_LITE_CRS7_HPE5_MASK                 (0x200000U)
#define AXBS_LITE_CRS7_HPE5_SHIFT                (21U)
#define AXBS_LITE_CRS7_HPE5_WIDTH                (1U)
#define AXBS_LITE_CRS7_HPE5(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS7_HPE5_SHIFT)) & AXBS_LITE_CRS7_HPE5_MASK)

#define AXBS_LITE_CRS7_HPE6_MASK                 (0x400000U)
#define AXBS_LITE_CRS7_HPE6_SHIFT                (22U)
#define AXBS_LITE_CRS7_HPE6_WIDTH                (1U)
#define AXBS_LITE_CRS7_HPE6(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS7_HPE6_SHIFT)) & AXBS_LITE_CRS7_HPE6_MASK)

#define AXBS_LITE_CRS7_HLP_MASK                  (0x40000000U)
#define AXBS_LITE_CRS7_HLP_SHIFT                 (30U)
#define AXBS_LITE_CRS7_HLP_WIDTH                 (1U)
#define AXBS_LITE_CRS7_HLP(x)                    (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS7_HLP_SHIFT)) & AXBS_LITE_CRS7_HLP_MASK)

#define AXBS_LITE_CRS7_RO_MASK                   (0x80000000U)
#define AXBS_LITE_CRS7_RO_SHIFT                  (31U)
#define AXBS_LITE_CRS7_RO_WIDTH                  (1U)
#define AXBS_LITE_CRS7_RO(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS7_RO_SHIFT)) & AXBS_LITE_CRS7_RO_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group AXBS_LITE_Register_Masks */

/*!
 * @}
 */ /* end of group AXBS_LITE_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K358_AXBS_LITE_H_) */
